## Plan output

```
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.application.module.service.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_region.current: Reading...
module.application.module.database.data.aws_rds_engine_version.this: Reading...
module.application.module.database.data.aws_partition.current: Reading...
module.application.module.database.module.database.data.aws_partition.current: Reading...
module.bastion.data.aws_ami.bastion: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.logging.data.aws_partition.current: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.application.module.service.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.worker.data.aws_region.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_region.current: Reading...
module.application.module.dashboard.data.aws_route53_zone.domain["this"]: Reading...
module.bastion.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.logging.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.database.data.aws_caller_identity.identity: Reading...
module.application.module.database.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.secrets.data.aws_caller_identity.identity: Reading...
module.application.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.application.module.secrets.data.aws_partition.current: Reading...
module.application.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.backend.data.aws_caller_identity.identity: Reading...
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.data.aws_lambda_functions.all: Reading...
module.application.module.dashboard.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.logging.data.aws_lambda_functions.all: Reading...
module.application.module.service.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.bastion.data.aws_caller_identity.identity: Reading...
module.bastion.data.aws_ami.bastion: Read complete after 0s [id=ami-0150ccaf51ab55a51]
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.bastion.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.service.data.aws_partition.current: Reading...
module.application.module.secrets.data.aws_region.current: Reading...
module.application.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.application.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.worker.data.aws_caller_identity.identity: Reading...
module.application.module.service.data.aws_region.current: Reading...
module.application.module.database.data.aws_region.current: Reading...
module.application.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.dashboard.data.aws_caller_identity.identity: Reading...
module.application.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.module.s3.data.aws_region.current: Reading...
module.application.module.dashboard.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.application.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.application.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.application.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_availability_zones.available: Reading...
module.application.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.application.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.bastion.data.aws_partition.current: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.dashboard.data.aws_partition.current: Reading...
module.application.module.dashboard.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.backend.data.aws_partition.current: Reading...
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 0s [id=o-f5mr0gq6lc]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.application.module.database.data.aws_rds_engine_version.this: Read complete after 0s [id=17.5]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.application.module.dashboard.module.alb["this"].data.aws_partition.current: Reading...
module.application.module.dashboard.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.dashboard.data.aws_region.current: Reading...
module.application.module.dashboard.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.worker.data.aws_partition.current: Reading...
module.application.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=705826187]
module.application.data.aws_lambda_function.datadog["this"]: Reading...
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=2124188810]
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 1s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=90403638]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 1s [id=us-east-1]
module.application.module.service.data.aws_vpc.current: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.application.module.worker.data.aws_vpc.current: Reading...
module.application.module.dashboard.data.aws_vpc.current: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.application.module.service.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.application.module.dashboard.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.application.module.worker.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # module.application.module.dashboard.aws_acm_certificate.endpoint["this"] will be created
  + resource "aws_acm_certificate" "endpoint" {
      + arn                       = (known after apply)
      + domain_name               = "dashboard.qa.getchildcareil.org"
      + domain_validation_options = [
          + {
              + domain_name           = "dashboard.qa.getchildcareil.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dashboard.qa.getchildcareil.org",
        ]
      + tags                      = {
          + "service" = "application-dashboard"
        }
      + tags_all                  = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-dashboard"
          + "tofu"        = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.application.module.dashboard.aws_acm_certificate_validation.endpoint["this"] will be created
  + resource "aws_acm_certificate_validation" "endpoint" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.application.module.dashboard.aws_route53_record.endpoint["this"] will be created
  + resource "aws_route53_record" "endpoint" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dashboard.qa.getchildcareil.org"
      + type            = "A"
      + zone_id         = "Z056235726NAHLFZ5UGDD"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.application.module.dashboard.aws_route53_record.endpoint_validation["dashboard.qa.getchildcareil.org"] will be created
  + resource "aws_route53_record" "endpoint_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z056235726NAHLFZ5UGDD"
    }

  # module.application.module.dashboard.module.alb["this"].aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "il-gcc-qa-dshbd"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "environment"           = "qa"
          + "project"               = "illinois-getchildcare"
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
          + "tofu"                  = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)

      + timeouts {}
    }

  # module.application.module.dashboard.module.alb["this"].aws_lb_listener.this["http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "environment"           = "qa"
          + "project"               = "illinois-getchildcare"
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
          + "tofu"                  = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.application.module.dashboard.module.alb["this"].aws_lb_listener.this["https"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags                                                                  = {
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "environment"           = "qa"
          + "project"               = "illinois-getchildcare"
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
          + "tofu"                  = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.application.module.dashboard.module.alb["this"].aws_lb_target_group.this["endpoint"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "il-gcc-qa-dshbd-app"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "environment"           = "qa"
          + "project"               = "illinois-getchildcare"
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
          + "tofu"                  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0d4fbd78717d772f7"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.application.module.dashboard.module.alb["this"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for il-gcc-qa-dshbd application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "il-gcc-qa-dshbd-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "environment"           = "qa"
          + "project"               = "illinois-getchildcare"
          + "service"               = "application-dashboard"
          + "terraform-aws-modules" = "alb"
          + "tofu"                  = "true"
        }
      + vpc_id                 = "vpc-0d4fbd78717d772f7"
    }

  # module.application.module.dashboard.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-qa-dashboard/illinois-getchildcare-qa-dashboard"
        name                               = "illinois-getchildcare-qa-dashboard"
        tags                               = {
            "service" = "application-dashboard"
        }
        # (18 unchanged attributes hidden)

      ~ load_balancer {
          + availability_zone_rebalancing      = (known after apply)
          + cluster                            = (known after apply)
          + deployment_maximum_percent         = (known after apply)
          + deployment_minimum_healthy_percent = (known after apply)
          + desired_count                      = (known after apply)
          + enable_ecs_managed_tags            = (known after apply)
          + enable_execute_command             = (known after apply)
          + force_delete                       = (known after apply)
          + force_new_deployment               = (known after apply)
          + health_check_grace_period_seconds  = (known after apply)
          + iam_role                           = (known after apply)
          + id                                 = (known after apply)
          + launch_type                        = (known after apply)
          + name                               = (known after apply)
          + platform_version                   = (known after apply)
          + propagate_tags                     = (known after apply)
          + scheduling_strategy                = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + task_definition                    = (known after apply)
          + triggers                           = (known after apply)
          + wait_for_steady_state              = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```